software/caTissue/modules/caTissueStaticDataService/test/SOAP-XMLs/InsertParticipant-Object.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
    <soapenv:Header>
        <wsa:MessageID soapenv:mustUnderstand="0">uuid:9d7b0cd0-220a-11e1-9106-cecd22613dca</wsa:MessageID>
        <wsa:To soapenv:mustUnderstand="0">http://t520:9090/wsrf/services/cagrid/Catissue_cacore</wsa:To>
        <wsa:Action soapenv:mustUnderstand="0">http://domain.catissuecore.wustl.edu/Catissue_cacore/InsertRequest
        </wsa:Action>
        <wsa:From soapenv:mustUnderstand="0">
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soapenv:Header>
    <soapenv:Body>
        <InsertRequest xmlns="http://domain.catissuecore.wustl.edu/Catissue_cacore">
            <object activityStatus="Active" firstName="First1323396477620" identifier="0" lastName="Last1323396477620"
                    xsi:type="ns1:Participant" xmlns:ns1="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.ws">
                <ns1:raceCollection>
                    <ns1:Race identifier="0" raceName="Asian"/>
                    <ns1:Race identifier="0" raceName="Unknown"/>
                    <ns1:Race identifier="0" raceName="White"/>
                </ns1:raceCollection>
                <ns1:participantMedicalIdentifierCollection>
                    <ns1:ParticipantMedicalIdentifier identifier="0" medicalRecordNumber="MRN-01-1323396478492">
                        <ns1:site>
                            <ns1:Site dirtyEditFlag="false" identifier="1" name="In Transit" remoteId="0"
                                      remoteManagedFlag="false"/>
                        </ns1:site>
                    </ns1:ParticipantMedicalIdentifier>
                    <ns1:ParticipantMedicalIdentifier identifier="0" medicalRecordNumber="MRN-02-1323396478492">
                        <ns1:site>
                            <ns1:Site dirtyEditFlag="false" identifier="1" name="In Transit" remoteId="0"
                                      remoteManagedFlag="false"/>
                        </ns1:site>
                    </ns1:ParticipantMedicalIdentifier>
                </ns1:participantMedicalIdentifierCollection>
                <ns1:participantRecordEntryCollection>
                    <ns2:ParticipantRecordEntry identifier="0"
                                                xmlns:ns2="gme://caCORE.caCORE/3.2/edu.wustl.catissuecore.domain.deintegration.ws"/>
                </ns1:participantRecordEntryCollection>
                <ns1:collectionProtocolRegistrationCollection>
                    <ns1:CollectionProtocolRegistration activityStatus="Active" identifier="0"
                                                        protocolParticipantIdentifier="WS_PPI-011323396478491"
                                                        registrationDate="2011-12-09T02:07:58.491Z">
                        <ns1:collectionProtocol>
                            <ns1:CollectionProtocol activityStatus="Active" aliquotInSameContainer="false"
                                                    consentsWaived="false" dirtyEditFlag="false" identifier="0"
                                                    remoteId="1323396477627" remoteManagedFlag="false"
                                                    shortTitle="System Test Site 1323396477620"
                                                    startDate="2011-12-09T02:07:57.627Z" studyCalendarEventPoint="0.0"
                                                    title="System Test Site 1323396477620">
                                <ns1:principalInvestigator>
                                    <ns1:User csmUserId="0" dirtyEditFlag="false" firstTimeLogin="false" identifier="1"
                                              remoteId="0" remoteManagedFlag="false"/>
                                </ns1:principalInvestigator>
                                <ns1:collectionProtocolEventCollection>
                                    <ns1:CollectionProtocolEvent activityStatus="Active"
                                                                 clinicalDiagnosis="Not Specified"
                                                                 clinicalStatus="Not Specified"
                                                                 collectionPointLabel="CPE - point label" identifier="0"
                                                                 labelFormat="%CP_DEFAULT%"
                                                                 studyCalendarEventPoint="5.0">
                                        <ns1:specimenCollectionSite>
                                            <ns1:Site dirtyEditFlag="false" identifier="1" remoteId="0"
                                                      remoteManagedFlag="false"/>
                                        </ns1:specimenCollectionSite>
                                    </ns1:CollectionProtocolEvent>
                                </ns1:collectionProtocolEventCollection>
                                <ns1:siteCollection>
                                    <ns1:Site dirtyEditFlag="false" identifier="1" remoteId="0"
                                              remoteManagedFlag="false"/>
                                </ns1:siteCollection>
                                <ns1:coordinatorCollection>
                                    <ns1:User csmUserId="0" dirtyEditFlag="false" firstTimeLogin="false" identifier="2"
                                              remoteId="0" remoteManagedFlag="false"/>
                                </ns1:coordinatorCollection>
                            </ns1:CollectionProtocol>
                        </ns1:collectionProtocol>
                    </ns1:CollectionProtocolRegistration>
                </ns1:collectionProtocolRegistrationCollection>
            </object>
        </InsertRequest>
    </soapenv:Body>
</soapenv:Envelope>
